![logo](https://camo.githubusercontent.com/66784b401a2c92615e1000466e1f17a681dca179a2aacc8b4cb15d70eacc09ae/68747470733a2f2f342e62702e626c6f6773706f742e636f6d2f2d6637597850797148417a592f574a36566e6b76453053492f41414141414141414454512f307444515054725672744d4146542d712d312d336b7455515435496c3946476451434c63422f733335302f73696d704c494e6e6f766174696f6e31612e706e67)

# Akses SQL Database (`ipython-sql`)

Install `ipython-sql` via pip or conda:

- `$ pip install ipython-sql`

- `$ conda install ipython-sql`

In [2]:
%load_ext sql

In [3]:
%reload_ext sql

<hr> 

## 1. Akses MySQL

In [4]:
# database url: 
# engine://username:password@host:port/database
mysql_con = 'mysql://lintang:12345@localhost:3306'

In [5]:
# %sql $mysql_con query
%sql $mysql_con create database company

1 rows affected.

[]

In [6]:
%sql $mysql_con show databases

25 rows affected.

[('campaign',),
 ('company',),
 ('dokoda',),
 ('haha',),
 ('information_schema',),
 ('meo',),
 ('mqtt_lintang',),
 ('mqttjs',),
 ('mqttpy',),
 ('music',),
 ('mysql',),
 ('pandas_tes',),
 ('performance_schema',),
 ('pokemon',),
 ('ptabc',),
 ('ptdci',),
 ('ptxyz',),
 ('sakila',),
 ('sys',),
 ('testing',),
 ('unafeed',),
 ('world',),
 ('world2',),
 ('x',),
 ('zzz',)]

In [7]:
mysql_con = 'mysql://lintang:12345@localhost:3306/company'

In [8]:
%sql $mysql_con show tables

0 rows affected.

[]

In [9]:
%sql $mysql_con create table employee (id int, name varchar(255), age int)

0 rows affected.

[]

In [10]:
%sql $mysql_con show tables

1 rows affected.

[('employee',)]

In [11]:
%sql $mysql_con insert into employee (1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)

(_mysql_exceptions.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)' at line 1") [SQL: "insert into employee (1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)"] (Background on this error at: http://sqlalche.me/e/f405)

In [12]:
%sql $mysql_con insert into employee values (1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)

3 rows affected.

[]

In [13]:
%sql $mysql_con select * from employee

3 rows affected.

[(1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)]

<hr> 

## 2. Akses PostgreSQL

In [21]:
# database url: 
# engine://username:password@host:port/database
postgre_con = 'postgresql://postgres:12345@localhost:5432/tokoku'

In [16]:
# aktivasi query special postgres: pip install pgspecial
! pip install pgspecial

Requirement already satisfied: pgspecial in c:\python37\lib\site-packages (1.11.10)
Requirement already satisfied: click>=4.1 in c:\python37\lib\site-packages (from pgspecial) (7.0)
Requirement already satisfied: sqlparse>=0.1.19 in c:\python37\lib\site-packages (from pgspecial) (0.2.4)
Requirement already satisfied: psycopg2>=2.7.4 in c:\python37\lib\site-packages (from pgspecial) (2.7.6.1)

In [23]:
# list databases
%sql $postgre_con \l

7 rows affected.

[('gudang',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('lin_flask',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('postgres',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('template0',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  '=c/postgres\npostgres=CTc/postgres'),
 ('template1',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  '=c/postgres\npostgres=CTc/postgres'),
 ('tokoku',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('ujicoba',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None)]

In [24]:
%sql $postgre_con \d

4 rows affected.

[('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres'),
 ('public', 'pegawai_id_seq', 'sequence', 'postgres')]

In [25]:
%sql $postgre_con \dt

3 rows affected.

[('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres')]

In [26]:
%sql $postgre_con create table avengers (id int, name varchar(255), age int)

Done.

[]

In [27]:
%sql $postgre_con \d

5 rows affected.

[('public', 'avengers', 'table', 'postgres'),
 ('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres'),
 ('public', 'pegawai_id_seq', 'sequence', 'postgres')]

In [28]:
%sql $postgre_con insert into avengers values (1, 'Capt. America', 23), (2, 'Iron Man', 24)

2 rows affected.

[]

In [29]:
%sql $postgre_con select * from avengers

2 rows affected.

[(1, 'Capt. America', 23), (2, 'Iron Man', 24)]

<hr> 

## 3. Akses SQLite

In [3]:
# database url: 
# engine://username:password@host:port/database
sqlite_con = 'sqlite://:@/dc.db'

In [4]:
%sql $sqlite_con create table justiceleague (id int, name varchar(255), age int)

Done.

[]

In [5]:
%sql $sqlite_con insert into justiceleague values (1, 'Superman', 28), (2, 'Batman', 29)

2 rows affected.

[]

In [6]:
%sql $sqlite_con select * from justiceleague

Done.

[(1, 'Superman', 28), (2, 'Batman', 29)]